RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/src/bl808_sdh.c
    return stat;
}

/****************************************************************************/ /**
 * @brief  SDH set clock
 *
 * @param  srcClock: Source clock frequency in Hz
 * @param  busClock: SDH clock frequency in Hz
 *
 * @return None
 *
*******************************************************************************/
void SDH_SetSdClock(uint32_t srcClock, uint32_t busClock)
{
    uint16_t tmpVal;
    uint16_t div = srcClock / busClock / 2;

    tmpVal = BL_RD_REG16(SDH_BASE, SDH_SD_CLOCK_CTRL);

    /* Disable internal clock*/
    tmpVal = BL_CLR_REG_BIT(tmpVal, SDH_INT_CLK_EN);
    tmpVal = BL_CLR_REG_BIT(tmpVal, SDH_SD_CLK_EN);

    /* Set divdier */
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SDH_SD_FREQ_SEL_LO, div & 0xff);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SDH_SD_FREQ_SEL_HI, (div >> 8) & 0x3);
    /* 0x1 = Programmable Clock Mode,0x0 = Divided Clock mode */
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SDH_CLK_GEN_SEL, 0);

    /* Enable internal clock*/
    tmpVal = BL_SET_REG_BIT(tmpVal, SDH_INT_CLK_EN);
    tmpVal = BL_SET_REG_BIT(tmpVal, SDH_SD_CLK_EN);

    BL_WR_REG16(SDH_BASE, SDH_SD_CLOCK_CTRL, tmpVal);

    /* Wait for clock stable */
    do {
        tmpVal = BL_RD_REG16(SDH_BASE, SDH_SD_CLOCK_CTRL);
    } while (!BL_IS_REG_BIT_SET(tmpVal, SDH_INT_CLK_STABLE));
}

/****************************************************************************/ /**
 * @brief  SDH disable clock
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
void SDH_DisableSdClock(void)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(SDH_BASE, SDH_SD_CLOCK_CTRL);

    /* Disable internal clock*/
    tmpVal = BL_CLR_REG_BIT(tmpVal, SDH_INT_CLK_EN);
    tmpVal = BL_CLR_REG_BIT(tmpVal, SDH_SD_CLK_EN);

    BL_WR_REG(SDH_BASE, SDH_SD_CLOCK_CTRL, tmpVal);
}
/****************************************************************************
 * @brief  SDH init function
 *
 * @param  cfg: SDH config pointer
 *
 * @return None
 *
*******************************************************************************/
void SDH_Powon(void)
{
    uint32_t tmpVal;
    tmpVal = BL_RD_REG16(SDH_BASE, SDH_SD_HOST_CTRL);
    tmpVal = BL_SET_REG_BIT(tmpVal, SDH_SD_BUS_POWER);
    BL_WR_REG16(SDH_BASE, SDH_SD_HOST_CTRL, tmpVal);
}
/****************************************************************************
 * @brief  SDH init function
 *
 * @param  cfg: SDH config pointer
 *
 * @return None
 *
*******************************************************************************/
void SDH_Ctrl_Init(const SDH_Cfg_Type *cfg)
{
    uint32_t tmpVal;

    SDH_SetSdClock(cfg->srcClock, cfg->busClock);
    SDH_DisableDMA();

    /* Set SDH config */
    tmpVal = BL_RD_REG16(SDH_BASE, SDH_SD_HOST_CTRL);

    if (cfg->dataWidth == SDH_DATA_BUS_WIDTH_8BITS) {
        tmpVal = BL_SET_REG_BIT(tmpVal, SDH_EX_DATA_WIDTH);
    } else {
        tmpVal = BL_CLR_REG_BIT(tmpVal, SDH_EX_DATA_WIDTH);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SDH_DATA_WIDTH, cfg->dataWidth);
    }

    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SDH_HI_SPEED_EN, cfg->highSpeed);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SDH_SD_BUS_VLT, cfg->volt);

    BL_WR_REG16(SDH_BASE, SDH_SD_HOST_CTRL, tmpVal);

    if (cfg->vlot18Enable) {
        tmpVal = BL_RD_REG16(SDH_BASE, SDH_HOST_CTRL_2);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SDH_UHS_MODE_SEL, cfg->speed);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SDH_SDH_V18_EN, cfg->vlot18Enable);
        BL_WR_REG16(SDH_BASE, SDH_HOST_CTRL_2, tmpVal);
    }

    tmpVal = BL_RD_REG(SDH_BASE, SDH_TX_CFG_REG);
    tmpVal = BL_SET_REG_BIT(tmpVal, SDH_TX_INT_CLK_SEL);
    BL_WR_REG(SDH_BASE, SDH_TX_CFG_REG, tmpVal);

    SDH_EnableStatus();

#ifndef BFLB_USE_HAL_DRIVER
    Interrupt_Handler_Register(SDH_IRQn, SDH_MMC1_IRQHandler);
#endif
}

/****************************************************************************/ /**
 * @brief  SDH deinit function
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
void SDH_Deinit(void)
{
    SDH_DisableDMA();
}

/****************************************************************************/ /**
 * @brief  SDH reset function
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
void SDH_Reset(void)
{
    uint16_t tmpVal;

    tmpVal = BL_RD_REG16(SDH_BASE, SDH_SD_TIMEOUT_CTRL_SW_RESET);
    tmpVal = BL_SET_REG_BIT(tmpVal, SDH_SW_RST_ALL);
    BL_WR_REG16(SDH_BASE, SDH_SD_TIMEOUT_CTRL_SW_RESET, tmpVal);

    /* Wait for reset done */
    do {
        tmpVal = BL_RD_REG16(SDH_BASE, SDH_SD_TIMEOUT_CTRL_SW_RESET);
    } while (BL_IS_REG_BIT_SET(tmpVal, SDH_SW_RST_ALL));
}
/****************************************************************************/ /**
 * @brief  SDH set timeout function
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
void SDH_Set_Timeout(uint8_t tmo)
{
    uint16_t tmpVal;

    tmpVal = BL_RD_REG16(SDH_BASE, SDH_SD_TIMEOUT_CTRL_SW_RESET);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SDH_TIMEOUT_VALUE, tmo);
    BL_WR_REG16(SDH_BASE, SDH_SD_TIMEOUT_CTRL_SW_RESET, tmpVal);
}

/****************************************************************************/ /**
 * @brief  SDH get capability
 *
 * @param  capability: None
 *
 * @return None
 *
*******************************************************************************/
void SDH_GetCapability(SDH_Cap_Cfg_Type *capability)
{
    /* Get the capability  */
    capability->maxBlockLength = 512;
    capability->maxBlockCount = 65536;
    capability->flags = (SDH_CAP_SUPPORT_8BITS |
                         SDH_CAP_SUPPORT_ADMA2 |
                         SDH_CAP_SUPPORT_ADMA1 |
                         SDH_CAP_SUPPORT_HIGHSPEED |
                         SDH_CAP_SUPPORT_SDMA |
                         SDH_CAP_SUPPORT_SUS_RES |
                         SDH_CAP_SUPPORT_VLT33 |
                         SDH_CAP_SUPPORT_VLT18 |
                         SDH_CAP_SUPPORT_SBUS_64BITS |
                         SDH_CAP_SUPPORT_ASYNC_INT |
                         SDH_CAP_SUPPORT_DDR50 |
                         SDH_CAP_SUPPORT_SDR104 |
                         SDH_CAP_SUPPORT_SDR50 |
                         SDH_CAP_SUPPORT_DRV_TYPE_A |
                         SDH_CAP_SUPPORT_DRV_TYPE_C |
                         SDH_CAP_SUPPORT_DRV_TYPE_D |
                         SDH_CAP_SUPPORT_SDR50_TUNE);
}

/****************************************************************************/ /**
 * @brief  SDH create ADMA1 descriptor
 *
 * @param  adma1Entries: ADMA1 entries pointer
 * @param  maxEntries: ADMA1 entries size
 * @param  data: Data buffer to deal with
 * @param  dataLen: Data length
 * @param  flag: ADMA setting flag
 *
 * @return SDH deal status
 *
*******************************************************************************/
SDH_Stat_Type SDH_CreateADMA1Descriptor(uint32_t *adma1Entries, uint32_t maxEntries,
                                        const uint32_t *data, uint32_t dataLen, SDH_ADMA_Flag_Type flag)
{
    uint32_t miniEntries, startEntries = 0U;
    uint32_t i, dmaBufferLen = 0U;

    if (((uintptr_t)data % SDH_ADMA1_ADDRESS_ALIGN) != 0U) {
        return SDH_STAT_DMA_ADDR_NOT_ALIGN;
    }

