RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/src/bl808_sdh.c
    if (flag == SDH_ADMA_FLAG_MULTI_DESC) {
        return SDH_STAT_NOT_SUPPORT;
    }

    /* TODO:align */
    /* Make sure the buffer size is 4 byte aligned */
    if (dataLen % sizeof(uint32_t) != 0U) {
        /* make the data length as word-aligned */
        dataLen += sizeof(uint32_t) - (dataLen % sizeof(uint32_t));
    }

    /* Check if ADMA descriptor's number is enough. */
    if ((dataLen % SDH_ADMA1_DESCRIPTOR_MAX_LENGTH_PER_ENTRY) == 0U) {
        miniEntries = dataLen / SDH_ADMA1_DESCRIPTOR_MAX_LENGTH_PER_ENTRY;
    } else {
        miniEntries = ((dataLen / SDH_ADMA1_DESCRIPTOR_MAX_LENGTH_PER_ENTRY) + 1U);
    }

    /* ADMA1 needs two descriptors to finish a transfer */
    miniEntries <<= 1U;

    if (miniEntries + startEntries > maxEntries) {
        return SDH_STAT_OUTOF_RANGE;
    }

    for (i = startEntries; i < (miniEntries + startEntries); i += 2U) {
        if (dataLen > SDH_ADMA1_DESCRIPTOR_MAX_LENGTH_PER_ENTRY) {
            dmaBufferLen = SDH_ADMA1_DESCRIPTOR_MAX_LENGTH_PER_ENTRY;
        } else {
            dmaBufferLen = dataLen;
        }

        adma1Entries[i] = (dmaBufferLen << SDH_ADMA1_DESCRIPTOR_LENGTH_POS);
        adma1Entries[i] |= SDH_ADMA1_DESC_FLAG_SETLEN;
        adma1Entries[i + 1U] = (uintptr_t)(data);
        adma1Entries[i + 1U] |= SDH_ADMA1_DESC_FLAG_TRANSFER;
        data += (dmaBufferLen / sizeof(uint32_t));
        dataLen -= dmaBufferLen;
    }

    /* Set end of the descriptor */
    adma1Entries[i - 1U] |= SDH_ADMA1_DESC_FLAG_END;

    return SDH_STAT_SUCCESS;
}

/****************************************************************************/ /**
 * @brief  SDH create ADMA2 descriptor
 *
 * @param  adma2Entries: ADMA2 entries pointer
 * @param  maxEntries: ADMA2 entries size
 * @param  data: Data buffer to deal with
 * @param  dataLen: Data length
 * @param  flag: ADMA setting flag
 *
 * @return SDH deal status
 *
*******************************************************************************/
SDH_Stat_Type SDH_CreateADMA2Descriptor(SDH_ADMA2_Desc_Type *adma2Entries, uint32_t maxEntries,
                                        const uint32_t *data, uint32_t dataLen, SDH_ADMA_Flag_Type flag)
{
    uint32_t miniEntries, startEntries = 0U;
    uint32_t i, dmaBufferLen = 0U;

    if (((uintptr_t)data % SDH_ADMA2_ADDRESS_ALIGN) != 0U) {
        return SDH_STAT_DMA_ADDR_NOT_ALIGN;
    }

    /* TODO:align */
    /* Make sure the buffer size is 4 byte aligned */
    if (dataLen % sizeof(uint32_t) != 0U) {
        /* make the data length as word-aligned */
        dataLen += sizeof(uint32_t) - (dataLen % sizeof(uint32_t));
    }

    /* Check if ADMA descriptor's number is enough. */
    if ((dataLen % SDH_ADMA2_DESCRIPTOR_MAX_LENGTH_PER_ENTRY) == 0U) {
        miniEntries = dataLen / SDH_ADMA2_DESCRIPTOR_MAX_LENGTH_PER_ENTRY;
    } else {
        miniEntries = ((dataLen / SDH_ADMA2_DESCRIPTOR_MAX_LENGTH_PER_ENTRY) + 1U);
    }

    /* Calculate the start entry for multiple descriptor mode, ADMA engine is not stop, so update the descriptor
    data address and data size is enough */
    if (flag == SDH_ADMA_FLAG_MULTI_DESC) {
        for (i = 0U; i < maxEntries; i++) {
            if ((adma2Entries[i].attribute & SDH_ADMA2_DESC_FLAG_VALID) == 0U) {
                break;
            }
        }

        startEntries = i;
        /* Add one entry for dummy entry */
        miniEntries += 1U;
    }

    if (miniEntries + startEntries > maxEntries) {
        return SDH_STAT_OUTOF_RANGE;
    }

    for (i = startEntries; i < (miniEntries + startEntries); i++) {
        if (dataLen > SDH_ADMA2_DESCRIPTOR_MAX_LENGTH_PER_ENTRY) {
            dmaBufferLen = SDH_ADMA2_DESCRIPTOR_MAX_LENGTH_PER_ENTRY;
        } else {
            /* TODO:align */
            /* Adma don't support 0 data length transfer descriptor */
            dmaBufferLen = (dataLen == 0U ? sizeof(uint32_t) : dataLen);
        }

        /* Each descriptor for ADMA2 is 64-bit in length */
        adma2Entries[i].address = (dataLen == 0U) ? (uint32_t)(uintptr_t)&bootDummy : (uint32_t)(uintptr_t)data;
        adma2Entries[i].attribute = (dmaBufferLen << SDH_ADMA2_DESCRIPTOR_LENGTH_POS);
        adma2Entries[i].attribute |= (dataLen == 0U) ? 0U : (SDH_ADMA2_DESC_FLAG_TRANSFER);
        // (dataLen == 0U) ? 0U : (SDH_ADMA2_DESC_FLAG_TRANSFER | SDH_ADMA2_DESC_FLAG_INT);
        /* TODO:align */
        data += (dmaBufferLen / sizeof(uint32_t));

        if (dataLen != 0U) {
            dataLen -= dmaBufferLen;
        }
    }

    /* add a dummy valid ADMA descriptor for multiple descriptor mode, this is useful when transfer boot data, the ADMA
    engine  will not stop at block gap */
    if (flag == SDH_ADMA_FLAG_MULTI_DESC) {
        //adma2Entries[startEntries + 1U].attribute |= SDH_ADMA2_DESC_FLAG_TRANSFER;
        adma2Entries[i - 1U].attribute |= SDH_ADMA2_DESC_FLAG_TRANSFER;
    } else {
        /* Set the end bit */
        adma2Entries[i - 1U].attribute |= SDH_ADMA2_DESC_FLAG_END;
    }

    return SDH_STAT_SUCCESS;
}

/****************************************************************************/ /**
 * @brief  SDH set DMA config
 *
 * @param  dmaCfg: DMA config pointer
 * @param  data: Data pointer for sending
 * @param  enAutoCmd23: Whether enable auto command 23
 *
 * @return DMA config deal status
 *
*******************************************************************************/
SDH_Stat_Type SDH_SetInternalDmaConfig(SDH_DMA_Cfg_Type *dmaCfg, const uint32_t *data, uint8_t enAutoCmd23)
{
    uint16_t tmpVal;

    if (dmaCfg->dmaMode == SDH_DMA_MODE_SIMPLE) {
        /* Check DMA data buffer address align or not */
        if (((uintptr_t)data % SDH_SDMA_LENGTH_ALIGN) != 0U) {
            return SDH_STAT_DMA_ADDR_NOT_ALIGN;
        }

        /* In simple DMA mode if use auto CMD23, address should load to ADMA addr,
             and block count should load to DS_ADDR*/
        if (enAutoCmd23) {
            BL_WR_REG(SDH_BASE, SDH_SD_ADMA_SYS_ADDR_1, (uintptr_t)data);
        } else {
            BL_WR_REG(SDH_BASE, SDH_SD_SYS_ADDR_LOW, (uintptr_t)data);
        }
    } else {
        /* When use ADMA, disable simple DMA */
        BL_WR_REG(SDH_BASE, SDH_SD_SYS_ADDR_LOW, (uint32_t)0);
        BL_WR_REG(SDH_BASE, SDH_SD_ADMA_SYS_ADDR_1, (uintptr_t)(dmaCfg->admaEntries));
    }

    /* Select DMA mode and config the burst length */
    SDH_EnableDMA(dmaCfg->dmaMode);

