RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/src/bl808_sdh.c
    /* Config the data transfer parameter */
    stat = SDH_ConfigDataTranfer(dataCfg);

    if (SDH_STAT_SUCCESS != stat) {
        return stat;
    }

    /* Send command first */
    if (dataCfg != NULL) {
        cmdCfg->flag |= SDH_TRANS_FLAG_DATA_PRESENT;
    }

#if 0
    SDH_SendCommand(cmdCfg);


    /* Wait command done */
    if((dataCfg == NULL) || (dataCfg->dataType == SDH_TRANS_DATA_NORMAL))
    {
        stat = SDH_WaitCommandDone(cmdCfg);
    }

#endif

    return SDH_STAT_SUCCESS;
}

/****************************************************************************/ /**
 * @brief  SDH install callback function for handler
 *
 * @param  handle: SDH handler
 * @param  callBack: SDH callBack function
 * @param  userData: User private data for SDH handler
 *
 * @return None
 *
*******************************************************************************/
void SDH_InstallHandleCallback(SDH_Handle_Cfg_Type *handle,
                               const SDH_Trans_Callback_Cfg_Type *callBack, void *userData)
{
    /* Zero the handle. */
    ARCH_MemSet(handle, 0, sizeof(SDH_Handle_Cfg_Type));

    /* Set the callback. */
    handle->callBack.SDH_CallBack_CardInserted = callBack->SDH_CallBack_CardInserted;
    handle->callBack.SDH_CallBack_CardRemoved = callBack->SDH_CallBack_CardRemoved;
    handle->callBack.SDH_CallBack_SdioInterrupt = callBack->SDH_CallBack_SdioInterrupt;
    handle->callBack.SDH_CallBack_BlockGap = callBack->SDH_CallBack_BlockGap;
    handle->callBack.SDH_CallBack_TransferFinished = callBack->SDH_CallBack_TransferFinished;
    handle->callBack.SDH_CMDCallBack_TransferFinished = callBack->SDH_CMDCallBack_TransferFinished;
    handle->callBack.SDH_CallBack_ReTuning = callBack->SDH_CallBack_ReTuning;
    handle->callBack.SDH_CallBack_Vendor = callBack->SDH_CallBack_ReTuning;
    handle->userData = userData;

    /* Save the handle in global variables  */
    sdhHandle = handle;
}

/****************************************************************************/ /**
 * @brief  SDH interrupt handle
 *
 * @param  intPeriph: Select the peripheral
 * @param  handle: SDH handler
 *
 * @return None
 *
*******************************************************************************/
#if (defined BOOTROM) || (!defined BFLB_USE_HAL_DRIVER)
static void SDH_IntHandler(IRQn_Type intPeriph, SDH_Handle_Cfg_Type *handle)
{
    uint32_t intFlag, intMask;

    intFlag = SDH_GetIntStatus();
    intMask = SDH_GetIntEnableStatus();
    intFlag &= intMask;

    if (NULL == handle) {
        SDH_ClearIntStatus(intFlag);
        return;
    }

    handle->intFlag = intFlag;

    /* Card insert interrupt */
    if (intFlag & SDH_INT_CARD_INSERT) {
        if (NULL != handle->callBack.SDH_CallBack_CardInserted) {
            handle->callBack.SDH_CallBack_CardInserted(handle->userData);
        }
    }

    /* Card remove interrupt */
    if (intFlag & SDH_INT_CARD_REMOVE) {
        if (NULL != handle->callBack.SDH_CallBack_CardRemoved) {
            handle->callBack.SDH_CallBack_CardRemoved(handle->userData);
        }
    }

    /* Command error interrupt */
    if (intFlag & (SDH_INT_CMD_ERRORS)) {
        if (NULL != handle->callBack.SDH_CMDCallBack_TransferFinished) {
            handle->callBack.SDH_CMDCallBack_TransferFinished(handle, SDH_STAT_SEND_CMD_FAIL, handle->userData);
        }
    }

    /* Command success interrupt */
    if (intFlag & SDH_INT_CMD_COMPLETED) {
        if (NULL != handle->callBack.SDH_CMDCallBack_TransferFinished &&
            NULL == handle->dataCfg) {
            /* Only deal with pure command, user need check response to make sure in SDH_CallBack_TransferFinished */
            handle->callBack.SDH_CMDCallBack_TransferFinished(handle, SDH_STAT_SUCCESS, handle->userData);
        }
    }

    /* Data error interrupt */
    if (intFlag & (SDH_INT_DATA_ERRORS | SDH_INT_DMA_ERROR)) {
        if (NULL != handle->callBack.SDH_CallBack_TransferFinished) {
            handle->callBack.SDH_CallBack_TransferFinished(handle, SDH_STAT_SEND_DATA_FAIL, handle->userData);
        }
    }

    /* Data success interrupt*/
    if (intFlag & SDH_INT_DATA_COMPLETED) {
        if (NULL != handle->callBack.SDH_CallBack_TransferFinished) {
            handle->callBack.SDH_CallBack_TransferFinished(handle, SDH_STAT_SUCCESS, handle->userData);
        }
    }

    /* Card interrupt */
    if (intFlag & SDH_INT_CARD) {
        if (handle->callBack.SDH_CallBack_SdioInterrupt) {
            handle->callBack.SDH_CallBack_SdioInterrupt(handle->userData);
        }
    }

    /* Buffer read ready interrupt*/
    if (intFlag & SDH_INT_BUFFER_READ_READY) {
        if (NULL != handle->callBack.SDH_CallBack_TransferFinished) {
            handle->callBack.SDH_CallBack_TransferFinished(handle, SDH_STAT_SUCCESS, handle->userData);
        } else {
            handle->dataCfg->rxDataLen += SDH_ReadDataPort(handle->dataCfg);
        }
    }

    /* Buffer write ready interrupt */
    if (intFlag & SDH_INT_BUFFER_WRITE_READY) {
        if (NULL != handle->callBack.SDH_CallBack_TransferFinished) {
            handle->dataCfg->txDataLen += SDH_WriteDataPort(handle->dataCfg);
        }
    }

    /* DMA success interrupt*/
    if (intFlag & SDH_INT_DMA_COMPLETED) {
        if (handle->dataCfg->dataType == SDH_TRANS_DATA_BOOT_CONT) {
            *(handle->dataCfg->rxData) = bootDummy;
        }
    }

    /* Block gap event interrupt */
    if (intFlag & SDH_INT_BLK_GAP_EVENT) {
        if (handle->callBack.SDH_CallBack_BlockGap) {
            handle->callBack.SDH_CallBack_BlockGap(handle->userData);
        }
    }

    /* Re-tuning event interrupt */
    if (intFlag & SDH_INT_RETUNE_EVENT) {
        if (handle->callBack.SDH_CallBack_ReTuning) {
            handle->callBack.SDH_CallBack_ReTuning(handle->userData);
        }
    }

    /* Vendor specified interrupt */
    if (intFlag & (SDH_INT_SPI_ERROR |
                   SDH_INT_AXI_RESP_ERROR |
                   SDH_INT_CPL_TIMEOUT_ERROR |
                   SDH_INT_CRC_STAT_ERROR)) {
        if (handle->callBack.SDH_CallBack_Vendor) {
            handle->callBack.SDH_CallBack_Vendor(handle->userData);
        }
    }

    SDH_ClearIntStatus(intFlag);
}
#endif

/****************************************************************************/ /**
 * @brief  SDH interrupt handler
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
#if (defined BOOTROM) || (!defined BFLB_USE_HAL_DRIVER)
void SDH_MMC1_IRQHandler(void)
{
    SDH_IntHandler(SDH_IRQn, sdhHandle);
}
#endif

/*@} end of group SDH_Public_Functions */

/*@} end of group SDH */

/*@} end of group BL808_Peripheral_Driver */
